cask_args appdir: "/Applications"

# brew
brew "asdf"
brew "awscli"
brew "bat"
brew "curl"
brew "gh"
brew "ghq"
brew "gnu-sed"
brew "gnupg"
brew "golang-migrate"
brew "grep"
brew "fzf"
brew "jq"
brew "just"
brew "libpq"
brew "pinentry-mac"
brew "herdr" # agent multiplexer
brew "sheldon"
brew "starship"
brew "tmux"
brew "tree"
brew "trivy"
brew "actionlint"
brew "mycli"
brew "pgcli"
brew "pinact"
brew "duckdb"
brew "uv"
brew "tflint"
brew "packer"
brew "graphviz"
brew "azure-cli"
brew "cloudflare-wrangler"
brew "playwright-cli"
## modern CLI
brew "eza"     # ls代替
brew "fd"      # find代替
brew "ripgrep" # grep代替
brew "zoxide"  # smart cd

# tap
tap "hashicorp/tap" # hashicorp

# cask
cask "alfred"
cask "iina"
cask "notion"
cask "appcleaner"
cask "dropbox"
cask "iterm2"
cask "bettertouchtool"
cask "stats"
cask "cyberduck"
cask "gcloud-cli"
cask "keepassxc"
cask "visual-studio-code"
cask "slack"
cask "figma"
cask "drawio"
cask "chatgpt"
cask "atok"
cask "claude"
cask "claude-code@latest"
cask "pgadmin4"
cask "homerow"

# font
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-hack-nerd-font"
