cask_args appdir: "/Applications"

# brew
brew "ansible"
brew "awscli"
brew "circleci"
brew "gh"
brew "ghq"
brew "gnu-sed"
brew "gnupg"
brew "golang-migrate"
brew "grep"
brew "hub"
brew "jq"
brew "just"
brew "libpq"
brew "peco"
brew "pinentry-mac"
brew "pwgen"
brew "python@3.9"
brew "tmux"
brew "tree"
brew "starship"
brew "font-hackgen" # font
brew "font-hackgen-nerd" # font
brew "font-hack-nerd-font" # font
brew "asdf"
brew "sheldon"
brew "trivy"

# tap
tap "homebrew/cask-fonts" # font

# cask
cask "alfred"
cask "docker"
cask "iina"
cask "notion"
cask "appcleaner "
cask "dropbox"
cask "iterm2"
cask "raspberry-pi-imager"
cask "bettertouchtool "
cask "google-chrome"
cask "jetbrains-toolbox "
cask "stats"
cask "cyberduck"
cask "google-cloud-sdk"
cask "keepassx"
cask "visual-studio-code"
cask "slack"
cask "figma"