cask_args appdir: "/Applications"

# brew
brew "asdf"
brew "awscli"
brew "aws-vault"
brew "circleci"
brew "curl"
brew "gh"
brew "ghq"
brew "gnu-sed"
brew "gnupg"
brew "golang-migrate"
brew "grep"
brew "hub"
brew "jq"
brew "just"
brew "libpq"
brew "peco"
brew "pinentry-mac"
brew "pwgen"
brew "sheldon"
brew "starship"
brew "tmux"
brew "tree"
brew "trivy"
brew "actionlint"
brew "mycli"
brew "pgcli"
brew "pinact"
brew "duckdb"
brew "tflint"
brew "amazon-q"
brew "packer"
brew "graphviz"
brew "azure-cli"

# font
brew "font-hackgen"
brew "font-hackgen-nerd"
brew "font-hack-nerd-font"

# tap
tap "homebrew/cask-fonts" # font
tap "hashicorp/tap" # hashicorp

# cask
cask "alfred"
cask "docker"
cask "iina"
cask "notion"
cask "appcleaner"
cask "dropbox"
cask "iterm2"
cask "raspberry-pi-imager"
cask "bettertouchtool"
cask "google-chrome"
cask "stats"
cask "cyberduck"
cask "google-cloud-sdk"
cask "keepassx"
cask "visual-studio-code"
cask "slack"
cask "figma"
cask "drawio"
cask "chatgpt"
cask "kindle"
cask "atok"
