42crunch.vscode-openapi
anthropic.claude-code
be5invis.toml
bierner.emojisense
bierner.markdown-mermaid
biomejs.biome
dsznajder.es7-react-js-snippets
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
github.vscode-github-actions
golang.go
hashicorp.terraform
hediet.vscode-drawio
inferrinizzard.prettier-sql-vscode
mechatroner.rainbow-csv
mquandalle.graphql
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-playwright.playwright
ms-vscode-remote.remote-containers
oderwat.indent-rainbow
openai.chatgpt
pkief.material-icon-theme
pmneo.tsimporter
redhat.vscode-yaml
yzane.markdown-pdf
yzhang.markdown-all-in-one
zainchen.json
