42crunch.vscode-openapi
4ops.terraform
amazonwebservices.codewhisperer-for-command-line-companion
be5invis.toml
bierner.emojisense
bierner.markdown-mermaid
biomejs.biome
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
github.vscode-github-actions
golang.go
hashicorp.terraform
hediet.vscode-drawio
ics.japanese-proofreading
mechatroner.rainbow-csv
mquandalle.graphql
ms-ceintl.vscode-language-pack-ja
oderwat.indent-rainbow
pkief.material-icon-theme
pmneo.tsimporter
redhat.vscode-yaml
saoudrizwan.claude-dev
yzane.markdown-pdf
zainchen.json
