4ops.terraform
be5invis.toml
bierner.emojisense
bierner.markdown-mermaid
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.auto-rename-tag
github.copilot
github.copilot-chat
hashicorp.terraform
ics.japanese-proofreading
mechatroner.rainbow-csv
mquandalle.graphql
ms-ceintl.vscode-language-pack-ja
oderwat.indent-rainbow
pkief.material-icon-theme
saoudrizwan.claude-dev
zainchen.json
